#### IFCImportAction Enumeration

---

|  |
| --- |
| See Also |

The action of the IFC import.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum IFCImportAction ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration IFCImportAction ``` |

| Visual C++ |
| --- |
| ``` public enum class IFCImportAction ``` |

# Members

| Member name | Description |
| --- | --- |
| Open | Open a new project file. |
| Link | Link into an existing project file. |

# See Also

Autodesk.Revit.DB.IFC Namespace